In [1]:
import numpy as np
import pandas as pd
d = pd.read_csv("https://bit.ly/ds-korean-idol")
d

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수
0     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260
1   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947
2   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
3      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
4     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
5     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335
6     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792
7     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
8      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
10    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
11   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
12    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
13    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
14    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442

## 12.1. 피봇테이블
* 엑셀의 피봇테이블과 동일

그룹과 성별에 따른 키 평균 구하기
* 행인덱스 : 그룹
* 열인덱스 : 성별
* 값 : 키 평균

In [2]:
pd.pivot_table(d, index="그룹", columns="성별", values="키", aggfunc="mean")

성별             남자     여자
그룹
뉴이스트   177.766667    NaN
마마무           NaN  162.1
방탄소년단  176.560000    NaN
빅뱅     177.000000    NaN
아스트로   183.000000    NaN
핫샷     167.100000    NaN

In [7]:
pd.pivot_table(d, index="그룹", columns=("혈액형", "성별"), values="브랜드평판지수", aggfunc="mean")

혈액형            A                    AB          B                     O
성별            남자         여자         남자         남자         여자         남자
그룹
뉴이스트         NaN        NaN  3301654.0        NaN        NaN  4131964.5
마마무          NaN  7650928.0        NaN        NaN        NaN        NaN
방탄소년단  7865797.5        NaN  8073501.0        NaN        NaN  3747875.0
빅뱅     9916947.0        NaN        NaN        NaN        NaN        NaN
소녀시대         NaN  3918661.0        NaN        NaN        NaN        NaN
아스트로         NaN        NaN        NaN  3506027.0        NaN        NaN
아이들          NaN        NaN        NaN        NaN  4668615.0        NaN
핫샷     4036489.0        NaN        NaN        NaN        NaN        NaN

In [16]:
pd.DataFrame(d.groupby(["그룹", "혈액형"])["브랜드평판지수"].mean())

             브랜드평판지수
그룹    혈액형
뉴이스트  AB   3301654.0
      O    4131964.5
마마무   A    7650928.0
방탄소년단 A    7865797.5
      AB   8073501.0
      O    3747875.0
빅뱅    A    9916947.0
소녀시대  A    3918661.0
아스트로  B    3506027.0
아이들   B    4668615.0
핫샷    A    4036489.0

In [20]:
pd.pivot_table(d, index=("그룹", "혈액형"), values="브랜드평판지수", aggfunc="mean")

            브랜드평판지수
그룹
뉴이스트   3.855194e+06
마마무    7.650928e+06
방탄소년단  6.260169e+06
빅뱅     9.916947e+06
소녀시대   3.918661e+06
아스트로   3.506027e+06
아이들    4.668615e+06
핫샷     4.036489e+06